<template>
    <com-main>
        <div slot="content" class="content">
            <ul class='placeholder'>
                <li>填充列表 1 1 1 1 1 1 1 1 1 1 1</li>
                <li>填充列表 2 2 2 2 2 2 2 2 2 2 2</li>
                <li>填充列表 3 3 3 3 3 3 3 3 3 3 3</li>
                <li>填充列表 4 4 4 4 4 4 4 4 4 4 4</li>
                <li>填充列表 5 5 5 5 5 5 5 5 5 5 5</li>
                <li>填充列表 6 6 6 6 6 6 6 6 6 6 6</li>
                <li>填充列表 7 7 7 7 7 7 7 7 7 7 7</li>
                <li>填充列表 8 8 8 8 8 8 8 8 8 8 8</li>
                <li>填充列表 9 9 9 9 9 9 9 9 9 9 9</li>
                <li>填充列表 10 10 10 10 10 10 10 10 10 10 10</li>
                <li>填充列表 11 11 11 11 11 11 11 11 11 11 11</li>
                <li>填充列表 12 12 12 12 12 12 12 12 12 12 12</li>
                <li>填充列表 13 13 13 13 13 13 13 13 13 13 13</li>
                <li>填充列表 14 14 14 14 14 14 14 14 14 14 14</li>
                <li>填充列表 15 15 15 15 15 15 15 15 15 15 15</li>
                <li>填充列表 16 16 16 16 16 16 16 16 16 16 16</li>
                <li>填充列表 17 17 17 17 17 17 17 17 17 17 17</li>
                <li>填充列表 18 18 18 18 18 18 18 18 18 18 18</li>
                <li>填充列表 19 19 19 19 19 19 19 19 19 19 19</li>
                <li>填充列表 20 20 20 20 20 20 20 20 20 20 20</li>
                <li>填充列表 21 21 21 21 21 21 21 21 21 21 21</li>
                <li>填充列表 22 22 22 22 22 22 22 22 22 22 22</li>
                <li>填充列表 23 23 23 23 23 23 23 23 23 23 23</li>
                <li>填充列表 24 24 24 24 24 24 24 24 24 24 24</li>
                <li>填充列表 25 25 25 25 25 25 25 25 25 25 25</li>
                <li>填充列表 26 26 26 26 26 26 26 26 26 26 26</li>
                <li>填充列表 27 27 27 27 27 27 27 27 27 27 27</li>
                <li>填充列表 28 28 28 28 28 28 28 28 28 28 28</li>
                <li>填充列表 29 29 29 29 29 29 29 29 29 29 29</li>
                <li>填充列表 30 30 30 30 30 30 30 30 30 30 30</li>
                <li>填充列表 31 31 31 31 31 31 31 31 31 31 31</li>
                <li>填充列表 32 32 32 32 32 32 32 32 32 32 32</li>
                <li>填充列表 33 33 33 33 33 33 33 33 33 33 33</li>
                <li>填充列表 34 34 34 34 34 34 34 34 34 34 34</li>
                <li>填充列表 35 35 35 35 35 35 35 35 35 35 35</li>
                <li>填充列表 36 36 36 36 36 36 36 36 36 36 36</li>
                <li>填充列表 37 37 37 37 37 37 37 37 37 37 37</li>
                <li>填充列表 38 38 38 38 38 38 38 38 38 38 38</li>
                <li>填充列表 39 39 39 39 39 39 39 39 39 39 39</li>
                <li>填充列表 40 40 40 40 40 40 40 40 40 40 40</li>
                <li>填充列表 41 41 41 41 41 41 41 41 41 41 41</li>
                <li>填充列表 42 42 42 42 42 42 42 42 42 42 42</li>
                <li>填充列表 43 43 43 43 43 43 43 43 43 43 43</li>
                <li>填充列表 44 44 44 44 44 44 44 44 44 44 44</li>
                <li>填充列表 45 45 45 45 45 45 45 45 45 45 45</li>
                <li>填充列表 46 46 46 46 46 46 46 46 46 46 46</li>
                <li>填充列表 47 47 47 47 47 47 47 47 47 47 47</li>
                <li>填充列表 48 48 48 48 48 48 48 48 48 48 48</li>
                <li>填充列表 49 49 49 49 49 49 49 49 49 49 49</li>
                <li>填充列表 50 50 50 50 50 50 50 50 50 50 50</li>
                <li>填充列表 51 51 51 51 51 51 51 51 51 51 51</li>
                <li>填充列表 52 52 52 52 52 52 52 52 52 52 52</li>
                <li>填充列表 53 53 53 53 53 53 53 53 53 53 53</li>
                <li>填充列表 54 54 54 54 54 54 54 54 54 54 54</li>
                <li>填充列表 55 55 55 55 55 55 55 55 55 55 55</li>
                <li>填充列表 56 56 56 56 56 56 56 56 56 56 56</li>
                <li>填充列表 57 57 57 57 57 57 57 57 57 57 57</li>
                <li>填充列表 58 58 58 58 58 58 58 58 58 58 58</li>
                <li>填充列表 59 59 59 59 59 59 59 59 59 59 59</li>
                <li>填充列表 60 60 60 60 60 60 60 60 60 60 60</li>
            </ul>
            <div class="fixed" id="fixed" :class="{'isfixed': isFixed}">滚动是否固顶测试</div>
            <ul class='placeholder'>
                <li>填充列表 1 1 1 1 1 1 1 1 1 1 1</li>
                <li>填充列表 2 2 2 2 2 2 2 2 2 2 2</li>
                <li>填充列表 3 3 3 3 3 3 3 3 3 3 3</li>
                <li>填充列表 4 4 4 4 4 4 4 4 4 4 4</li>
                <li>填充列表 5 5 5 5 5 5 5 5 5 5 5</li>
                <li>填充列表 6 6 6 6 6 6 6 6 6 6 6</li>
                <li>填充列表 7 7 7 7 7 7 7 7 7 7 7</li>
                <li>填充列表 8 8 8 8 8 8 8 8 8 8 8</li>
                <li>填充列表 9 9 9 9 9 9 9 9 9 9 9</li>
                <li>填充列表 10 10 10 10 10 10 10 10 10 10 10</li>
                <li>填充列表 11 11 11 11 11 11 11 11 11 11 11</li>
                <li>填充列表 12 12 12 12 12 12 12 12 12 12 12</li>
                <li>填充列表 13 13 13 13 13 13 13 13 13 13 13</li>
                <li>填充列表 14 14 14 14 14 14 14 14 14 14 14</li>
                <li>填充列表 15 15 15 15 15 15 15 15 15 15 15</li>
                <li>填充列表 16 16 16 16 16 16 16 16 16 16 16</li>
                <li>填充列表 17 17 17 17 17 17 17 17 17 17 17</li>
                <li>填充列表 18 18 18 18 18 18 18 18 18 18 18</li>
                <li>填充列表 19 19 19 19 19 19 19 19 19 19 19</li>
                <li>填充列表 20 20 20 20 20 20 20 20 20 20 20</li>
                <li>填充列表 21 21 21 21 21 21 21 21 21 21 21</li>
                <li>填充列表 22 22 22 22 22 22 22 22 22 22 22</li>
                <li>填充列表 23 23 23 23 23 23 23 23 23 23 23</li>
                <li>填充列表 24 24 24 24 24 24 24 24 24 24 24</li>
                <li>填充列表 25 25 25 25 25 25 25 25 25 25 25</li>
                <li>填充列表 26 26 26 26 26 26 26 26 26 26 26</li>
                <li>填充列表 27 27 27 27 27 27 27 27 27 27 27</li>
                <li>填充列表 28 28 28 28 28 28 28 28 28 28 28</li>
                <li>填充列表 29 29 29 29 29 29 29 29 29 29 29</li>
                <li>填充列表 30 30 30 30 30 30 30 30 30 30 30</li>
                <li>填充列表 31 31 31 31 31 31 31 31 31 31 31</li>
                <li>填充列表 32 32 32 32 32 32 32 32 32 32 32</li>
                <li>填充列表 33 33 33 33 33 33 33 33 33 33 33</li>
                <li>填充列表 34 34 34 34 34 34 34 34 34 34 34</li>
                <li>填充列表 35 35 35 35 35 35 35 35 35 35 35</li>
                <li>填充列表 36 36 36 36 36 36 36 36 36 36 36</li>
                <li>填充列表 37 37 37 37 37 37 37 37 37 37 37</li>
                <li>填充列表 38 38 38 38 38 38 38 38 38 38 38</li>
                <li>填充列表 39 39 39 39 39 39 39 39 39 39 39</li>
                <li>填充列表 40 40 40 40 40 40 40 40 40 40 40</li>
                <li>填充列表 41 41 41 41 41 41 41 41 41 41 41</li>
                <li>填充列表 42 42 42 42 42 42 42 42 42 42 42</li>
                <li>填充列表 43 43 43 43 43 43 43 43 43 43 43</li>
                <li>填充列表 44 44 44 44 44 44 44 44 44 44 44</li>
                <li>填充列表 45 45 45 45 45 45 45 45 45 45 45</li>
                <li>填充列表 46 46 46 46 46 46 46 46 46 46 46</li>
                <li>填充列表 47 47 47 47 47 47 47 47 47 47 47</li>
                <li>填充列表 48 48 48 48 48 48 48 48 48 48 48</li>
                <li>填充列表 49 49 49 49 49 49 49 49 49 49 49</li>
                <li>填充列表 50 50 50 50 50 50 50 50 50 50 50</li>
                <li>填充列表 51 51 51 51 51 51 51 51 51 51 51</li>
                <li>填充列表 52 52 52 52 52 52 52 52 52 52 52</li>
                <li>填充列表 53 53 53 53 53 53 53 53 53 53 53</li>
                <li>填充列表 54 54 54 54 54 54 54 54 54 54 54</li>
                <li>填充列表 55 55 55 55 55 55 55 55 55 55 55</li>
                <li>填充列表 56 56 56 56 56 56 56 56 56 56 56</li>
                <li>填充列表 57 57 57 57 57 57 57 57 57 57 57</li>
                <li>填充列表 58 58 58 58 58 58 58 58 58 58 58</li>
                <li>填充列表 59 59 59 59 59 59 59 59 59 59 59</li>
                <li>填充列表 60 60 60 60 60 60 60 60 60 60 60</li>
                <li>填充列表 1 1 1 1 1 1 1 1 1 1 1</li>
                <li>填充列表 2 2 2 2 2 2 2 2 2 2 2</li>
                <li>填充列表 3 3 3 3 3 3 3 3 3 3 3</li>
                <li>填充列表 4 4 4 4 4 4 4 4 4 4 4</li>
                <li>填充列表 5 5 5 5 5 5 5 5 5 5 5</li>
                <li>填充列表 6 6 6 6 6 6 6 6 6 6 6</li>
                <li>填充列表 7 7 7 7 7 7 7 7 7 7 7</li>
                <li>填充列表 8 8 8 8 8 8 8 8 8 8 8</li>
                <li>填充列表 9 9 9 9 9 9 9 9 9 9 9</li>
                <li>填充列表 10 10 10 10 10 10 10 10 10 10 10</li>
                <li>填充列表 11 11 11 11 11 11 11 11 11 11 11</li>
                <li>填充列表 12 12 12 12 12 12 12 12 12 12 12</li>
                <li>填充列表 13 13 13 13 13 13 13 13 13 13 13</li>
                <li>填充列表 14 14 14 14 14 14 14 14 14 14 14</li>
                <li>填充列表 15 15 15 15 15 15 15 15 15 15 15</li>
                <li>填充列表 16 16 16 16 16 16 16 16 16 16 16</li>
                <li>填充列表 17 17 17 17 17 17 17 17 17 17 17</li>
                <li>填充列表 18 18 18 18 18 18 18 18 18 18 18</li>
                <li>填充列表 19 19 19 19 19 19 19 19 19 19 19</li>
                <li>填充列表 20 20 20 20 20 20 20 20 20 20 20</li>
                <li>填充列表 21 21 21 21 21 21 21 21 21 21 21</li>
                <li>填充列表 22 22 22 22 22 22 22 22 22 22 22</li>
                <li>填充列表 23 23 23 23 23 23 23 23 23 23 23</li>
                <li>填充列表 24 24 24 24 24 24 24 24 24 24 24</li>
                <li>填充列表 25 25 25 25 25 25 25 25 25 25 25</li>
                <li>填充列表 26 26 26 26 26 26 26 26 26 26 26</li>
                <li>填充列表 27 27 27 27 27 27 27 27 27 27 27</li>
                <li>填充列表 28 28 28 28 28 28 28 28 28 28 28</li>
                <li>填充列表 29 29 29 29 29 29 29 29 29 29 29</li>
                <li>填充列表 30 30 30 30 30 30 30 30 30 30 30</li>
                <li>填充列表 31 31 31 31 31 31 31 31 31 31 31</li>
                <li>填充列表 32 32 32 32 32 32 32 32 32 32 32</li>
                <li>填充列表 33 33 33 33 33 33 33 33 33 33 33</li>
                <li>填充列表 34 34 34 34 34 34 34 34 34 34 34</li>
                <li>填充列表 35 35 35 35 35 35 35 35 35 35 35</li>
                <li>填充列表 36 36 36 36 36 36 36 36 36 36 36</li>
                <li>填充列表 37 37 37 37 37 37 37 37 37 37 37</li>
                <li>填充列表 38 38 38 38 38 38 38 38 38 38 38</li>
                <li>填充列表 39 39 39 39 39 39 39 39 39 39 39</li>
                <li>填充列表 40 40 40 40 40 40 40 40 40 40 40</li>
                <li>填充列表 41 41 41 41 41 41 41 41 41 41 41</li>
                <li>填充列表 42 42 42 42 42 42 42 42 42 42 42</li>
                <li>填充列表 43 43 43 43 43 43 43 43 43 43 43</li>
                <li>填充列表 44 44 44 44 44 44 44 44 44 44 44</li>
                <li>填充列表 45 45 45 45 45 45 45 45 45 45 45</li>
                <li>填充列表 46 46 46 46 46 46 46 46 46 46 46</li>
                <li>填充列表 47 47 47 47 47 47 47 47 47 47 47</li>
                <li>填充列表 48 48 48 48 48 48 48 48 48 48 48</li>
                <li>填充列表 49 49 49 49 49 49 49 49 49 49 49</li>
                <li>填充列表 50 50 50 50 50 50 50 50 50 50 50</li>
                <li>填充列表 51 51 51 51 51 51 51 51 51 51 51</li>
                <li>填充列表 52 52 52 52 52 52 52 52 52 52 52</li>
                <li>填充列表 53 53 53 53 53 53 53 53 53 53 53</li>
                <li>填充列表 54 54 54 54 54 54 54 54 54 54 54</li>
                <li>填充列表 55 55 55 55 55 55 55 55 55 55 55</li>
                <li>填充列表 56 56 56 56 56 56 56 56 56 56 56</li>
                <li>填充列表 57 57 57 57 57 57 57 57 57 57 57</li>
                <li>填充列表 58 58 58 58 58 58 58 58 58 58 58</li>
                <li>填充列表 59 59 59 59 59 59 59 59 59 59 59</li>
                <li>填充列表 60 60 60 60 60 60 60 60 60 60 60</li>
            </ul>
        </div>
    </com-main>
</template>
<script>
    import comMain from '../components/default.vue';
    let ele;
    let i = 0;
    export default{//这个是 es6的导出, 和 commonsJS 的 module.exports 不一样
        data(){
            return{
                isFixed: false,
            }
        },
        components: {
            comMain,
        },
        methods:{
            onScroll(){
                let vm = this;
                vm.isFixed = ele.getBoundingClientRect().top <= 50;
            }
        },
        mounted(){
            ele = document.getElementById('fixed');
            this.isFixed = ele.getBoundingClientRect().top <= 50;
            window.addEventListener('scroll', this.onScroll)
        }
    }
</script>

<style scope lang="scss">
    ul.placeholder{
        width: 100%;
        padding: 0;
        margin-top: 10px;
        li{
            border: 1px solid #2aabd2;
            width: 100%;
            height: 20px;
            line-height: 20px;
            list-style-type: none;
        }
    }
    div.fixed{
        background-color: red;
        width: 100%;
        height: 30px;
        line-height: 30px;
        z-index: 999;
        margin-top: 50px;
        position: relative;
    }
    div.isfixed{
        width: 100%;
        height: 30px;
        line-height: 30px;
        z-index: 999;
        top: 50px;
        position: fixed;
        position: -webkit-sticky;
        position: sticky;
    }
</style>
